[
    "Lights will be automatically on in the evening at 6 PM and automatically off in the morning at 5 AM. TestCaseID: tc1 Current Hour: 18 Current Minute: 30 Current Day: 1 Current Month: 3 Temperature (\u0081E\u0081EC): 25.5 Expected Output: lights on, ac on, fan off TestCaseID: tc3 Current Hour: 5 Current Minute: 1 Current Day: 4 Current Month: 7 Temperature (\u0081E\u0081EC): 22.0 Expected Output: lights off, ac off, fan off",
    "AC will automatically turn ON when the room temperature is above 24°C. TestCaseID: tc1 Current Hour: 18 Current Minute: 30 Current Day: 1 Current Month: 3 Temperature (\u0081E\u0081EC): 25.5 Expected Output: lights on, ac on, fan off TestCaseID: tc4 Current Hour: 10 Current Minute: 0 Current Day: 6 Current Month: 6 Temperature (\u0081E\u0081EC): 26.0 Expected Output: lights off, ac on, fan on, washing machine started",
    "AC will switch to heater mode when the temperature is below 10°C. TestCaseID: tc2 Current Hour: 4 Current Minute: 0 Current Day: 3 Current Month: 5 Temperature (\u0081E\u0081EC): 8.0 Expected Output: lights on, heater on, fan off TestCaseID: tc9 Current Hour: 6 Current Minute: 0 Current Day: 1 Current Month: 4 Temperature (\u0081E\u0081EC): 9.0 Expected Output: lights off, heater on",
    "If the month is between April and June, turn on the fan along with the AC. TestCaseID: tc4 Current Hour: 10 Current Minute: 0 Current Day: 6 Current Month: 6 Temperature (\u0081E\u0081EC): 26.0 Expected Output: lights off, ac on, fan on, washing machine started TestCaseID: tc6 Current Hour: 18 Current Minute: 0 Current Day: 0 Current Month: 4 Temperature (\u0081E\u0081EC): 26.0 Expected Output: lights on, ac on, fan on",
    "Washing machine will automatically turn on every Sunday morning at 10 AM. TestCaseID: tc4 Current Hour: 10 Current Minute: 0 Current Day: 6 Current Month: 6 Temperature (\u0081E\u0081EC): 26.0 Expected Output: lights off, ac on, fan on, washing machine started TestCaseID: tc8 Current Hour: 10 Current Minute: 0 Current Day: 6 Current Month: 3 Temperature (\u0081E\u0081EC): 26.0 Expected Output: lights off, ac on, fan off, washing machine started",
    "Water supply to the garden will start automatically every day at 7 AM. TestCaseID: tc5 Current Hour: 7 Current Minute: 0 Current Day: 2 Current Month: 8 Temperature (\u0081E\u0081EC): 23.5 Expected Output: lights off, ac off, fan off, garden watering started"
]